Repository: khyeji98/RunningDiary
Catalog: RunDiary/Resources/Localizable.xcstrings
Source language: ko
Languages: en, ja

# difficulty_adverb.easy
source: 가볍게
en: at ease
ja: 余裕を持って

# difficulty_adverb.hard
source: 힘차게
en: pushing hard
ja: 力を込めて

# difficulty_adverb.medium
source: 무리 없이
en: comfortably
ja: 無理なく

# difficulty_adverb.very_easy
source: 산책하듯
en: like a stroll
ja: 散歩のように

# difficulty_adverb.very_hard
source: 전력을 다해
en: with all my might
ja: 全力で

# difficulty_level.easy
source: 쉬움
en: Easy
ja: 簡単

# difficulty_level.hard
source: 어려움
en: Hard
ja: 難しい

# difficulty_level.medium
source: 보통
en: Medium
ja: 普通

# difficulty_level.short.very_easy
source: 매우 쉬움
en: Very Easy
ja: とても楽

# difficulty_level.short.very_hard
source: 매우 힘듦
en: Very Hard
ja: とても大変

# difficulty_level.very_easy
source: 매우 쉬움
en: Very Easy
ja: とても簡単

# difficulty_level.very_hard
source: 매우 어려움
en: Very Hard
ja: とても難しい

# error.generic
source: 오류가 발생했습니다
en: An error occurred
ja: エラーが発生しました

# format.total_km
source: 총 %@km
en: Total %@km
ja: 合計%@km

# format.view_diary_date
source: %1$lld월 %2$lld일 다이어리 보기
en: View diary for %1$lld/%2$lld
ja: %1$lld月%2$lld日の日記を見る

# healthkit.data.empty
source: 건강 데이터 접근 거부됨
en: Health data access denied
ja: ヘルスデータへのアクセスが拒否されました

# healthkit.data.loading
source: 피트니스 기록을 가져오는 중입니다!
en: Loading fitness data!
ja: フィットネスデータを読み込んでいます！

# healthkit.data.permission_message
source: 러닝 데이터를 가져오기 위해 설정에서 접근을 허용해주세요.
en: Please allow access in Settings to fetch running data.
ja: ランニングデータを取得するには、設定でアクセスを許可してください。

# healthkit.error.authorization_failed
source: HealthKit 권한 요청에 실패했습니다. 잠시 후 다시 시도해주세요.
en: Failed to request HealthKit authorization. Please try again later.
ja: HealthKitの権限リクエストに失敗しました。後でもう一度お試しください。

# healthkit.error.data_not_found
source: 데이터를 찾을 수 없습니다.
en: Data not found
ja: データが見つかりませんでした。

# healthkit.error.fetch_context
source: HealthKit 데이터를 가져올 수 없습니다
en: Failed to fetch HealthKit data
ja: HealthKitデータの取得に失敗しました

# healthkit.error.not_available
source: 이 기기에서는 HealthKit을 사용할 수 없습니다.
en: HealthKit is not available on this device.
ja: このデバイスではHealthKitを使用できません。

# healthkit.fetch_failed_title
source: 피트니스 데이터 가져오기 실패
en: Failed to fetch fitness data
ja: フィットネスデータの取得に失敗しました

# pain_area.achilles
source: 아킬레스건
en: Achilles
ja: アキレス腱

# pain_area.ankle
source: 발목
en: Ankle
ja: 足首

# pain_area.calf
source: 종아리
en: Calf
ja: ふくらはぎ

# pain_area.chest
source: 가슴
en: Chest
ja: 胸

# pain_area.hip
source: 고관절
en: Hip
ja: 股関節

# pain_area.knee
source: 무릎
en: Knee
ja: 膝

# pain_area.neck
source: 뒷목
en: Nape
ja: 首

# pain_area.shin
source: 정강이
en: Shin splints
ja: すね

# pain_area.shoulder
source: 어깨
en: Shoulder
ja: 肩

# pain_area.side
source: 옆구리
en: Side stitch
ja: 脇腹

# pain_area.sole
source: 발바닥
en: Sole
ja: 足裏

# pain_area.waist
source: 허리
en: Waist
ja: 腰

# record.add
source: 기록 추가
en: Add Record
ja: 記録を追加

# record.add_button
source: 기록 추가하기
en: Add Record
ja: 記録を追加する

# record.edit
source: 기록 수정
en: Edit Record
ja: 記録を編集

# record.empty
source: 러닝 기록이 없습니다
en: No running records
ja: ランニング記録がありません

# record.error.fetch_context
source: 기록을 불러올 수 없습니다
en: Failed to load record
ja: 記録の読み込みに失敗しました

# record.error.save_context
source: 기록 저장에 실패했습니다
en: Failed to save record
ja: 記録の保存に失敗しました

# record.field.active_energy
source: 소모 칼로리
en: Active Calories
ja: 消費カロリー

# record.field.cadence
source: 평균 케이던스
en: Average Cadence
ja: 平均ケイデンス

# record.field.condition
source: 컨디션
en: Condition
ja: コンディション

# record.field.distance
source: 거리
en: Distance
ja: 距離

# record.field.duration
source: 소요시간
en: Duration
ja: 所要時間

# record.field.ground_contact_time
source: 접지 시간
en: Ground Contact Time
ja: 接地時間

# record.field.heart_rate
source: 평균 심박수
en: Average Heart Rate
ja: 平均心拍数

# record.field.intensity_placeholder
source: 운동 강도를 선택해주세요!
en: Please select exercise intensity!
ja: 運動強度を選択してください！

# record.field.map
source: 지도 영역
en: Map Area
ja: 地図エリア

# record.field.pace
source: 평균 페이스
en: Average Pace
ja: 平均ペース

# record.field.running_power
source: 러닝 파워
en: Running Power
ja: ランニングパワー

# record.field.running_style_placeholder
source: 어떤 주법으로 달렸나요?
en: What running style did you use?
ja: どのような走法で走りましたか？

# record.field.shoes_placeholder
source: 어떤 신발을 착용하셨나요?
en: Which shoes did you wear?
ja: どの靴を履きましたか？

# record.field.time
source: 시간
en: Time
ja: 時間

# record.field.vertical_oscillation
source: 수직 진폭
en: Vertical Oscillation
ja: 上下動

# record.hero.summary
source: **%@km**를 **%@** 동안 달렸어요!
en: I ran **%@km** in **%@**!
ja: **%@km**を **%@**走りました！

# record.how_did_you_run
source: 어떻게 달렸나요?
en: How did you run?
ja: どう走りましたか？

# record.more_data
source: 더 많은 데이터
en: More Data
ja: その他のデータ

# record.placeholder.memo_new
source: ex) 평소보다 오버페이스로 뛰어서 조절이 필요할듯!
en: ex) Ran overpace, need adjustment!
ja: 例）オーバーペースだったので調整が必要かも！

# record.section.difficulty
source: 얼마나 힘들었나요?
en: How hard was it?
ja: どれくらいきつかったですか？

# record.section.how_run
source: 🏃‍♂️ 어떻게 달렸나요?
en: 🏃‍♂️ How did you run?
ja: 🏃‍♂️ どう走りましたか？

# record.section.memo
source: 더 기록하고 싶은 경험을 입력해주세요!
en: Please enter any other experiences you want to record!
ja: 他に記録しておきたいことを入力してください！

# record.section.pain
source: 🤕 어디가 아파요?
en: 🤕 Where does it hurt?
ja: 🤕 どこが痛いですか？

# record.section.pain_areas
source: 아픈 부위가 있었나요?
en: Did you have any pain areas?
ja: 痛む部位はありましたか？

# record.section.performance
source: 🔥 퍼포먼스는 어때요?
en: 🔥 How was your performance?
ja: 🔥 パフォーマンスはどうでしたか？

# record.section.running_style
source: 어떤 주법으로 달렸나요?
en: What running style did you use?
ja: どんな走法で走りましたか？

# record.section.shoes
source: 어떤 운동화를 착용했나요?
en: Which shoes did you wear?
ja: どの靴を履きましたか？

# record.section.workout
source: 운동 기록을 불러왔어요!
en: Workout data loaded!
ja: 運動記録を読み込みました！

# record.sentence.style
source: 으로,
en: with
ja: で、

# record.sentence.wearing
source: 을 신고,
en: Wearing
ja: を履いて、

# record.step.title.difficulty
source: 오늘 얼마나 힘들었나요?
en: How tough was it today?
ja: 今日はどれくらいきつかったですか？

# record.step.title.fitness
source: 오늘 이렇게 달렸어요!
en: Here's how you ran today!
ja: 今日はこんな風に走りました！

# record.step.title.memo
source: 더 남기고 싶은 이야기가 있나요?
en: Anything more you'd like to write?
ja: 他に残したい話はありますか？

# record.step.title.pain
source: 혹시 아픈 곳이 있었나요?
en: Did anything hurt?
ja: 痛むところはありましたか？

# record.step.title.shoes
source: 어떤 신발을 신었나요?
en: Which shoes did you wear?
ja: どの靴を履きましたか？

# record.step.title.style
source: 어떻게 달렸나요?
en: How did you run?
ja: どんな風に走りましたか？

# record.step.title.weather
source: 오늘 날씨는 어땠나요?
en: How was the weather today?
ja: 今日の天気はどうでしたか？

# record.summary.connector1
source: 을 신고,
en: wearing,
ja: を履いて、

# record.summary.connector2
source: 으로,
en: style,
ja: で、

# record.summary.ending
source: 달렸어요!
en: I ran
ja: 走りました！

# record.write_diary_button
source: 일기 쓰기
en: Write Diary
ja: 日記を書く

# record.write_title
source: 일기 작성
en: Write Diary
ja: 日記を書く

# repository.error.delete_failed
source: 기록 삭제에 실패했습니다.
en: Failed to delete record
ja: 記録の削除に失敗しました。

# repository.error.not_found
source: 기록을 찾을 수 없습니다.
en: Record not found
ja: 記録が見つかりませんでした。

# repository.error.save_failed
source: 기록 저장에 실패했습니다.
en: Failed to save record
ja: 記録の保存に失敗しました。

# repository.error.update_failed
source: 기록 업데이트에 실패했습니다.
en: Failed to update record
ja: 記録の更新に失敗しました。

# running_style.forefoot
source: 포어풋
en: Forefoot
ja: フォアフット

# running_style.heelfoot
source: 힐풋
en: Heelfoot
ja: ヒールフット

# running_style.midfoot
source: 미드풋
en: Midfoot
ja: ミッドフット

# settings.privacy_policy
source: 개인정보처리방침
en: Privacy Policy
ja: プライバシーポリシー

# settings.terms_of_service
source: 이용약관
en: Terms of Service
ja: 利用規約

# shoe.error.fetch_context
source: 신발 목록을 불러올 수 없습니다
en: Failed to load shoes
ja: シューズリストの読み込みに失敗しました

# shoe.error.fetch_failed
source: 신발 정보를 가져올 수 없습니다.
en: Failed to fetch shoes
ja: シューズ情報の取得に失敗しました。

# ui.back
source: 뒤로 가기
en: Back
ja: 戻る

# ui.cancel
source: 취소
en: Cancel
ja: キャンセル

# ui.done
source: 완료
en: Done
ja: 完了

# ui.edit
source: 수정
en: Edit
ja: 編集

# ui.go_to_settings
source: 설정으로 이동
en: Go to Settings
ja: 設定へ移動

# ui.next
source: 다음
en: Next
ja: 次へ

# ui.previous
source: 이전
en: Previous
ja: 前へ

# ui.save
source: 저장
en: Save
ja: 保存

# ui.today
source: 오늘
en: Today
ja: 今日

# ui.view_details
source: 자세히 보기
en: View Details
ja: 詳細を見る

# unit.hours
source: 시간
en: h
ja: 時間

# Weather from
source: 날씨 정보 제공
en: Weather from
ja: 天気情報提供元

# weather.category.feels_like
source: 체감 온도
en: Feels Like
ja: 体感温度

# weather.category.humidity
source: 습도
en: Humidity
ja: 湿度

# weather.category.sky
source: 하늘 상태
en: Sky
ja: 空の状態

# weather.category.wind
source: 바람
en: Wind
ja: 風

# weather.error.api_key_missing
source: 날씨 API 키가 없습니다.
en: Weather API key is missing
ja: 天気APIキーがありません。

# weather.error.data_unavailable
source: 날씨 데이터를 사용할 수 없습니다.
en: Weather data is unavailable
ja: 天気データを利用できません。

# weather.error.invalid_response
source: 날씨 API 응답이 올바르지 않습니다.
en: Invalid response from weather API
ja: 天気APIからの応答が無効です。

# weather.error.location_required
source: 날씨 데이터를 가져오려면 위치 정보가 필요합니다.
en: Location is required to fetch weather data
ja: 天気データを取得するには位置情報が必要です。

# weather.error.network_error
source: 네트워크 오류가 발생했습니다.
en: Network error occurred
ja: ネットワークエラーが発生しました。

# weather.feels.cold
source: 추움
en: Cold
ja: 寒い

# weather.feels.hot
source: 더움
en: Hot
ja: 暑い

# weather.feels.neutral
source: 적당함
en: Just right
ja: ちょうどいい

# weather.field.humidity
source: 습도
en: Humidity
ja: 湿度

# weather.field.temperature
source: 기온
en: Temperature
ja: 気温

# weather.field.wind_speed
source: 풍속
en: Wind Speed
ja: 風速

# weather.humid.dry
source: 건조
en: Dry
ja: 乾燥

# weather.humid.humid
source: 습함
en: Humid
ja: 湿気

# weather.no_data
source: 날씨 데이터 없음
en: No weather data
ja: 天気データなし

# weather.section.title
source: ☁️ 날씨는 어땠나요?
en: ☁️ How was the weather?
ja: ☁️ 天気はどうでしたか？

# weather.sentence.no_wind
source: 오늘의 날씨는 기온 %.0f°, 습도 %d%%
en: Today's weather: %.0f°, humidity %d%%
ja: 今日の天気は気温%.0f°、湿度%d%%

# weather.sentence.with_wind
source: 오늘의 날씨는 기온 %.0f°, 습도 %d%%, 그리고 바람이 센 편이에요
en: Today's weather: %.0f°, humidity %d%%, and windy
ja: 今日の天気は気温%.0f°、湿度%d%%、そして風が強いです

# weather.sky.cloudy
source: 흐림
en: Cloudy
ja: 曇り

# weather.sky.sunny
source: 맑음
en: Sunny
ja: 晴れ

# weather.wind.moderate
source: 보통
en: Moderate
ja: ふつう

# weather.wind.strong
source: 강함
en: Strong
ja: 強い

# weather.wind.weak
source: 약함
en: Calm
ja: 弱い

source: 설정
en: Settings
ja: 設定

# format.year_month
source: %1$@년 %2$@월
ja: %1$@年%2$@月
